app/Services/CounselingService.php

SELECT COUNT(*) AS `numrows`
FROM `counseling_sessions`
WHERE `counselor_id` = 15
AND `student_id` IS NOT NULL
---
                ->countAllResults(false),

            // Total students counseled
            'total_students' => $this->db->table('counseling_sessions')
                ->select('DISTINCT student_id')
                ->where('counselor_id', $counselorId)
                ->where('student_id IS NOT NULL')
                ->countAllResults(false),