app/Services/StudentService.php

        $builder->orderBy($orderBy, $orderDir);

        // Paginate
        return [
            'students' => $builder->paginate($perPage),
            'pager' => $this->studentModel->pager,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
WHERE `students`.`deleted_at` IS NULL
SELECT `students`.*, `users`.`full_name`, `users`.`email`, `users`.`username`, `users`.`phone`, `users`.`is_active`, `classes`.`class_name`, `classes`.`grade_level`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
WHERE `students`.`deleted_at` IS NULL
ORDER BY `students`.`created_at` DESC
 LIMIT 15

    public function getStudentStatistics()
    {
        $stats = [
            'total' => $this->studentModel->countAllResults(false),
            'active' => $this->studentModel->where('status', 'Aktif')->countAllResults(false),
            'alumni' => $this->studentModel->where('status', 'Alumni')->countAllResults(false),
            'moved' => $this->studentModel->where('status', 'Pindah')->countAllResults(false),
            'dropped' => $this->studentModel->where('status', 'Keluar')->countAllResults(false),
            'by_gender' => [],
            'by_grade' => [],
            'by_religion' => [],
        ];

        // Get count by gender
        $genderStats = $this->db->table('students')
            ->select('gender, COUNT(id) as total')
            ->where('deleted_at', null)
            ->groupBy('gender')
            ->get()
            ->getResultArray();

        foreach ($genderStats as $stat) {
            $stats['by_gender'][$stat['gender']] = (int) $stat['total'];
        }

        // Get count by grade
        $gradeStats = $this->db->table('students')
            ->select('classes.grade_level, COUNT(students.id) as total')
            ->join('classes', 'classes.id = students.class_id', 'left')
            ->where('students.deleted_at', null)
            ->where('students.status', 'Aktif')
            ->groupBy('classes.grade_level')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL
AND `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL
AND `status` = 'Aktif'
AND `status` = 'Alumni'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL
AND `status` = 'Aktif'
AND `status` = 'Alumni'
AND `status` = 'Pindah'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL
AND `status` = 'Aktif'
AND `status` = 'Alumni'
AND `status` = 'Pindah'
AND `status` = 'Keluar'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL
SELECT `gender`, COUNT(id) as total
FROM `students`
WHERE `deleted_at` IS NULL
GROUP BY `gender`
SELECT `classes`.`grade_level`, COUNT(students.id) as total
FROM `students`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
WHERE `students`.`deleted_at` IS NULL
AND `students`.`status` = 'Aktif'
GROUP BY `classes`.`grade_level`

        }

        // Get count by religion
        $religionStats = $this->db->table('students')
            ->select('religion, COUNT(id) as total')
            ->where('deleted_at', null)
            ->where('religion IS NOT NULL')
            ->groupBy('religion')
            ->get()
            ->getResultArray();
---
SELECT `religion`, COUNT(id) as total
FROM `students`
WHERE `deleted_at` IS NULL
AND `religion` IS NOT NULL
GROUP BY `religion`

    public function getAvailableClasses($academicYearId = null)
    {
        $builder = $this->classModel->select('classes.*, academic_years.year_name')
            ->join('academic_years', 'academic_years.id = classes.academic_year_id')
            ->where('classes.is_active', 1);

        if ($academicYearId) {
            $builder->where('classes.academic_year_id', $academicYearId);
        }

        return $builder->orderBy('classes.grade_level', 'ASC')
            ->orderBy('classes.class_name', 'ASC')
            ->findAll();
---
SELECT `classes`.*, `academic_years`.`year_name`
FROM `classes`
JOIN `academic_years` ON `academic_years`.`id` = `classes`.`academic_year_id`
WHERE `classes`.`is_active` = 1
AND `classes`.`deleted_at` IS NULL
ORDER BY `classes`.`grade_level` ASC, `classes`.`class_name` ASC