app/Services/UserService.php

    public function getAllUsers($filters = [], $perPage = 10)
    {
        $builder = $this->userModel->select('users.*, roles.role_name')
            ->join('roles', 'roles.id = users.role_id');

        // Apply filters
        if (!empty($filters['role_id'])) {
            $builder->where('users.role_id', $filters['role_id']);
        }

        if (!empty($filters['is_active'])) {
            $builder->where('users.is_active', $filters['is_active']);
        }

        if (!empty($filters['search'])) {
            $builder->groupStart()
                ->like('users.username', $filters['search'])
                ->orLike('users.email', $filters['search'])
                ->orLike('users.full_name', $filters['search'])
                ->groupEnd();
        }

        // Order by
        $orderBy = $filters['order_by'] ?? 'users.created_at';
        $orderDir = $filters['order_dir'] ?? 'DESC';
        $builder->orderBy($orderBy, $orderDir);

        // Paginate
        return [
            'users' => $builder->paginate($perPage),
            'pager' => $this->userModel->pager,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`deleted_at` IS NULL
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `users`.`created_at` DESC
 LIMIT 10

    public function getUserStatistics()
    {
        $stats = [
            'total' => $this->userModel->countAllResults(false),
            'active' => $this->userModel->where('is_active', 1)->countAllResults(false),
            'inactive' => $this->userModel->where('is_active', 0)->countAllResults(false),
            'by_role' => [],
        ];

        // Get count by role
        $roleStats = $this->db->table('users')
            ->select('roles.role_name, COUNT(users.id) as total')
            ->join('roles', 'roles.id = users.role_id')
            ->where('users.deleted_at', null)
            ->groupBy('roles.id')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `is_active` = 1
AND `is_active` = 0
SELECT `roles`.`role_name`, COUNT(users.id) as total
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`deleted_at` IS NULL
GROUP BY `roles`.`id`

    public function getRoles()
    {
        return $this->roleModel->orderBy('role_name', 'ASC')->findAll();
---
SELECT *
FROM `roles`
ORDER BY `role_name` ASC