app/Controllers/Admin/DashboardController.php

    public function index()
    {
        // Get current user
        $user = auth_user();

        // Get active academic year
        $activeYear = $this->academicYearModel->where('is_active', 1)->first();
---
SELECT *
FROM `academic_years`
WHERE `is_active` = 1
AND `academic_years`.`deleted_at` IS NULL
 LIMIT 1

    private function getTotalUsers()
    {
        return $this->userModel->where('is_active', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_active` = 1
AND `users`.`deleted_at` IS NULL

    private function getTotalStudents()
    {
        return $this->studentModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `students`.`deleted_at` IS NULL

    private function getTotalActiveStudents()
    {
        return $this->studentModel->where('status', 'Aktif')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `status` = 'Aktif'
AND `students`.`deleted_at` IS NULL

    private function getTotalClasses()
    {
        return $this->classModel->where('is_active', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `classes`
WHERE `is_active` = 1
AND `classes`.`deleted_at` IS NULL

    private function getUsersByRole()
    {
        $db = \Config\Database::connect();

        $query = $db->table('users')
            ->select('roles.role_name, COUNT(users.id) as total')
            ->join('roles', 'roles.id = users.role_id')
            ->where('users.is_active', 1)
            ->where('users.deleted_at', null)
            ->groupBy('roles.id, roles.role_name')
            ->get();
---
SELECT `roles`.`role_name`, COUNT(users.id) as total
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`is_active` = 1
AND `users`.`deleted_at` IS NULL
GROUP BY `roles`.`id`, `roles`.`role_name`

    private function getStudentsByGrade()
    {
        $db = \Config\Database::connect();

        $query = $db->table('students')
            ->select('classes.grade_level, COUNT(students.id) as total')
            ->join('classes', 'classes.id = students.class_id', 'left')
            ->where('students.status', 'Aktif')
            ->where('students.deleted_at', null)
            ->groupBy('classes.grade_level')
            ->orderBy('classes.grade_level', 'ASC')
            ->get();
---
SELECT `classes`.`grade_level`, COUNT(students.id) as total
FROM `students`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
WHERE `students`.`status` = 'Aktif'
AND `students`.`deleted_at` IS NULL
GROUP BY `classes`.`grade_level`
ORDER BY `classes`.`grade_level` ASC

    private function getStudentsByStatus()
    {
        $db = \Config\Database::connect();

        $query = $db->table('students')
            ->select('status, COUNT(id) as total')
            ->where('deleted_at', null)
            ->groupBy('status')
            ->get();
---
SELECT `status`, COUNT(id) as total
FROM `students`
WHERE `deleted_at` IS NULL
GROUP BY `status`

    private function getClassesByGrade($academicYearId)
    {
        $db = \Config\Database::connect();

        $query = $db->table('classes')
            ->select('grade_level, COUNT(id) as total')
            ->where('academic_year_id', $academicYearId)
            ->where('is_active', 1)
            ->where('deleted_at', null)
            ->groupBy('grade_level')
            ->orderBy('grade_level', 'ASC')
            ->get();
---
SELECT `grade_level`, COUNT(id) as total
FROM `classes`
WHERE `academic_year_id` = '2'
AND `is_active` = 1
AND `deleted_at` IS NULL
GROUP BY `grade_level`
ORDER BY `grade_level` ASC

    private function getRecentStudents($limit = 5)
    {
        return $this->studentModel
            ->select('students.*, users.full_name, users.email, classes.class_name, classes.grade_level')
            ->join('users', 'users.id = students.user_id')
            ->join('classes', 'classes.id = students.class_id', 'left')
            ->orderBy('students.created_at', 'DESC')
            ->limit($limit)
            ->find();
---
SELECT `students`.*, `users`.`full_name`, `users`.`email`, `classes`.`class_name`, `classes`.`grade_level`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
WHERE `students`.`deleted_at` IS NULL
ORDER BY `students`.`created_at` DESC
 LIMIT 5

    private function getRecentUsers($limit = 5)
    {
        return $this->userModel
            ->select('users.*, roles.role_name')
            ->join('roles', 'roles.id = users.role_id')
            ->orderBy('users.created_at', 'DESC')
            ->limit($limit)
            ->find();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `users`.`created_at` DESC
 LIMIT 5