app/Models/AssessmentModel.php

    public function getAssessmentWithDetails($id)
    {
        return $this->select('assessments.*,
                              users.full_name as creator_name,
                              users.email as creator_email,
                              classes.class_name as target_class_name')
            ->join('users', 'users.id = assessments.created_by')
            ->join('classes', 'classes.id = assessments.target_class_id', 'left')
            ->where('assessments.id', $id)
            ->first();
---
SELECT `assessments`.*, `users`.`full_name` as `creator_name`, `classes`.`class_name` as `target_class_name`
FROM `assessments`
JOIN `users` ON `users`.`id` = `assessments`.`created_by`
LEFT JOIN `classes` ON `classes`.`id` = `assessments`.`target_class_id`
WHERE `assessments`.`created_by` = '3'
AND `assessments`.`deleted_at` IS NULL
ORDER BY `assessments`.`created_at` DESC

    public function getCounselorStats($counselorId)
    {
        $stats = [
            'total_assessments' => $this->where('created_by', $counselorId)->countAllResults(false),
            'published' => $this->where('created_by', $counselorId)
                ->where('is_published', 1)
                ->countAllResults(false),
            'draft' => $this->where('created_by', $counselorId)
                ->where('is_published', 0)
                ->countAllResults(false),
            'active' => $this->where('created_by', $counselorId)
                ->where('is_active', 1)
                ->where('is_published', 1)
                ->countAllResults(false),
---
SELECT COUNT(*) AS `numrows`
FROM `assessments`
WHERE `created_by` = '3'
AND `assessments`.`deleted_at` IS NULL
AND `created_by` = '3'
AND `is_published` = 1
SELECT COUNT(*) AS `numrows`
FROM `assessments`
WHERE `created_by` = '3'
AND `assessments`.`deleted_at` IS NULL
AND `created_by` = '3'
AND `is_published` = 1
AND `created_by` = '3'
AND `is_published` = 0
SELECT COUNT(*) AS `numrows`
FROM `assessments`
WHERE `created_by` = '3'
AND `assessments`.`deleted_at` IS NULL
AND `created_by` = '3'
AND `is_published` = 1
AND `created_by` = '3'
AND `is_published` = 0
AND `created_by` = '3'
AND `is_active` = 1
AND `is_published` = 1