app/Models/CounselingSessionModel.php

    public function getStatistics($counselorId = null, $dateFrom = null, $dateTo = null)
    {
        $builder = $this->builder();

        if ($counselorId) {
            $builder->where('counselor_id', $counselorId);
        }

        if ($dateFrom) {
            $builder->where('session_date >=', $dateFrom);
        }

        if ($dateTo) {
            $builder->where('session_date <=', $dateTo);
        }

        $stats = [
            'total' => (clone $builder)->countAllResults(false),
            'by_type' => [],
            'by_status' => [],
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `counseling_sessions`
WHERE `counselor_id` = 15
AND `counseling_sessions`.`deleted_at` IS NULL
AND `counselor_id` = 15
AND `session_date` = '2025-10-06'
AND `status` != 'Dibatalkan'
AND `counselor_id` = 15
AND  `session_date` LIKE '%2025-10%' ESCAPE '!'
AND `status` != 'Dibatalkan'
AND `counselor_id` = 15
AND `session_date` >= '2025-10-06'
AND `status` = 'Dijadwalkan'
AND `counselor_id` = 15
AND `status` = 'Selesai'
AND `counselor_id` = 15
AND `counselor_id` = 15