app/Models/UserModel.php

    public function getUserWithRole($userId)
    {
        return $this->select('users.*, roles.role_name, roles.description as role_description')
            ->join('roles', 'roles.id = users.role_id')
            ->where('users.id', $userId)
            ->first();
---
SELECT `users`.*, `roles`.`role_name`, `roles`.`description` as `role_description`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '15'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function getUserWithPermissions($userId)
    {
        $user = $this->getUserWithRole($userId);

        if (!$user) {
            return null;
        }

        $db = \Config\Database::connect();

        $permissions = $db->table('role_permissions')
            ->select('permissions.permission_name')
            ->join('permissions', 'permissions.id = role_permissions.permission_id')
            ->where('role_permissions.role_id', $user['role_id'])
            ->get()
            ->getResultArray();
---
SELECT `permissions`.`permission_name`
FROM `role_permissions`
JOIN `permissions` ON `permissions`.`id` = `role_permissions`.`permission_id`
WHERE `role_permissions`.`role_id` = '3'

    public function authenticate($username, $password)
    {
        $user = $this->where('username', $username)
            ->orWhere('email', $username)
            ->first();

        if (!$user) {
            return false;
        }

        if (!password_verify($password, $user['password_hash'])) {
            return false;
        }

        if ($user['is_active'] != 1) {
            return false;
        }

        // Update last login
        $this->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);
---
SELECT *
FROM `users`
WHERE `username` = 'gurubk'
OR `email` = 'gurubk'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `users` SET `last_login` = '2025-10-06 14:27:08', `updated_at` = '2025-10-06 14:27:08'
WHERE `users`.`id` IN ('15')