app/Models/ViolationModel.php

SELECT `violation_categories`.`severity_level`, COUNT(violations.id) as violation_count, SUM(violation_categories.point_deduction) as total_points
FROM `violations`
JOIN `violation_categories` ON `violation_categories`.`id` = `violations`.`category_id`
WHERE `violations`.`deleted_at` IS NULL
GROUP BY `violation_categories`.`severity_level`
---
    public function getStatsBySeverity($filters = [])
    {
        $db = \Config\Database::connect();

        $builder = $db->table('violations')
            ->select('violation_categories.severity_level,
                      COUNT(violations.id) as violation_count,
                      SUM(violation_categories.point_deduction) as total_points')
            ->join('violation_categories', 'violation_categories.id = violations.category_id')
            ->where('violations.deleted_at', null)
            ->groupBy('violation_categories.severity_level');

        // Apply date filter
        if (!empty($filters['date_from'])) {
            $builder->where('violations.violation_date >=', $filters['date_from']);
        }

        if (!empty($filters['date_to'])) {
            $builder->where('violations.violation_date <=', $filters['date_to']);
        }

        return $builder->get()->getResultArray();

SELECT `violations`.*, `students`.`nisn`, `student_users`.`full_name` as `student_name`, `student_users`.`email` as `student_email`, `classes`.`class_name`, `violation_categories`.`category_name`, `violation_categories`.`severity_level`
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
JOIN `users` as `student_users` ON `student_users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
JOIN `violation_categories` ON `violation_categories`.`id` = `violations`.`category_id`
WHERE `violations`.`parent_notified` = 0
AND `violations`.`status` != 'Dibatalkan'
AND `violations`.`deleted_at` IS NULL
ORDER BY `violations`.`violation_date` DESC
 LIMIT 10
---
    public function getPendingNotifications($limit = 20)
    {
        return $this->select('violations.*,
                              students.nisn,
                              student_users.full_name as student_name,
                              student_users.email as student_email,
                              classes.class_name,
                              violation_categories.category_name,
                              violation_categories.severity_level')
            ->join('students', 'students.id = violations.student_id')
            ->join('users as student_users', 'student_users.id = students.user_id')
            ->join('classes', 'classes.id = students.class_id', 'left')
            ->join('violation_categories', 'violation_categories.id = violations.category_id')
            ->where('violations.parent_notified', 0)
            ->where('violations.status !=', 'Dibatalkan')
            ->orderBy('violations.violation_date', 'DESC')
            ->limit($limit)
            ->findAll();