app/Models/ViolationCategoryModel.php

SELECT *
FROM `violation_categories`
WHERE `is_active` = 1
AND `violation_categories`.`deleted_at` IS NULL
ORDER BY `severity_level` ASC, `point_deduction` ASC
---
    public function getActiveCategories()
    {
        return $this->where('is_active', 1)
            ->orderBy('severity_level', 'ASC')
            ->orderBy('point_deduction', 'ASC')
            ->findAll();