app/Controllers/Counselor/CaseController.php

    private function getActiveStudents()
    {
        return $this->studentModel
            ->select('students.id, students.nisn, students.nis, users.full_name, classes.class_name')
            ->join('users', 'users.id = students.user_id')
            ->join('classes', 'classes.id = students.class_id', 'left')
            ->where('students.status', 'Aktif')
            ->orderBy('users.full_name', 'ASC')
            ->findAll();
---
SELECT `students`.`id`, `students`.`nisn`, `students`.`nis`, `users`.`full_name`, `classes`.`class_name`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
WHERE `students`.`status` = 'Aktif'
AND `students`.`deleted_at` IS NULL
ORDER BY `users`.`full_name` ASC