app/Controllers/Counselor/DashboardController.php

    private function getTodaySessions($counselorId)
    {
        $today = date('Y-m-d');

        return $this->sessionModel
            ->select('counseling_sessions.*,
                      students.nisn, students.nis,
                      users.full_name as student_name,
                      classes.class_name')
            ->join('students', 'students.id = counseling_sessions.student_id', 'left')
            ->join('users', 'users.id = students.user_id', 'left')
            ->join('classes', 'classes.id = counseling_sessions.class_id', 'left')
            ->where('counseling_sessions.counselor_id', $counselorId)
            ->where('counseling_sessions.session_date', $today)
            ->where('counseling_sessions.status !=', 'Dibatalkan')
            ->orderBy('counseling_sessions.session_time', 'ASC')
            ->findAll();
---
SELECT `counseling_sessions`.*, `students`.`nisn`, `students`.`nis`, `users`.`full_name` as `student_name`, `classes`.`class_name`
FROM `counseling_sessions`
LEFT JOIN `students` ON `students`.`id` = `counseling_sessions`.`student_id`
LEFT JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `counseling_sessions`.`class_id`
WHERE `counseling_sessions`.`counselor_id` = 15
AND `counseling_sessions`.`session_date` = '2025-10-06'
AND `counseling_sessions`.`status` != 'Dibatalkan'
AND `counseling_sessions`.`deleted_at` IS NULL
ORDER BY `counseling_sessions`.`session_time` ASC

    private function getUpcomingSessions($counselorId)
    {
        $today = date('Y-m-d');
        $nextWeek = date('Y-m-d', strtotime('+7 days'));

        return $this->sessionModel
            ->select('counseling_sessions.*,
                      students.nisn, students.nis,
                      users.full_name as student_name,
                      classes.class_name')
            ->join('students', 'students.id = counseling_sessions.student_id', 'left')
            ->join('users', 'users.id = students.user_id', 'left')
            ->join('classes', 'classes.id = counseling_sessions.class_id', 'left')
            ->where('counseling_sessions.counselor_id', $counselorId)
            ->where('counseling_sessions.session_date >', $today)
            ->where('counseling_sessions.session_date <=', $nextWeek)
            ->where('counseling_sessions.status', 'Dijadwalkan')
            ->orderBy('counseling_sessions.session_date', 'ASC')
            ->orderBy('counseling_sessions.session_time', 'ASC')
            ->limit(10)
            ->findAll();
---
SELECT `counseling_sessions`.*, `students`.`nisn`, `students`.`nis`, `users`.`full_name` as `student_name`, `classes`.`class_name`
FROM `counseling_sessions`
LEFT JOIN `students` ON `students`.`id` = `counseling_sessions`.`student_id`
LEFT JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `counseling_sessions`.`class_id`
WHERE `counseling_sessions`.`counselor_id` = 15
AND `counseling_sessions`.`session_date` > '2025-10-06'
AND `counseling_sessions`.`session_date` <= '2025-10-13'
AND `counseling_sessions`.`status` = 'Dijadwalkan'
AND `counseling_sessions`.`deleted_at` IS NULL
ORDER BY `counseling_sessions`.`session_date` ASC, `counseling_sessions`.`session_time` ASC
 LIMIT 10

    private function getAssignedStudents($counselorId)
    {
        // Get students who have had sessions with this counselor
        // You might want to add a dedicated assignment table in the future
        $students = $this->db->table('students')
            ->select('students.id, students.nisn, students.nis, students.total_violation_points,
                      users.full_name as student_name, users.email,
                      classes.class_name,
                      COUNT(DISTINCT counseling_sessions.id) as total_sessions')
            ->join('users', 'users.id = students.user_id')
            ->join('classes', 'classes.id = students.class_id', 'left')
            ->join('counseling_sessions', 'counseling_sessions.student_id = students.id
                    AND counseling_sessions.counselor_id = ' . $counselorId, 'left')
            ->where('students.status', 'Aktif')
            ->groupBy('students.id, students.nisn, students.nis, students.total_violation_points,
                       users.full_name, users.email, classes.class_name')
            ->having('COUNT(DISTINCT counseling_sessions.id) >', 0)
            ->orderBy('total_sessions', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT `students`.`id`, `students`.`nisn`, `students`.`nis`, `students`.`total_violation_points`, `users`.`full_name` as `student_name`, `users`.`email`, `classes`.`class_name`, COUNT(DISTINCT counseling_sessions.id) as total_sessions
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id`
LEFT JOIN `counseling_sessions` ON `counseling_sessions`.`student_id` = `students`.`id` AND `counseling_sessions`.`counselor_id` = 15
WHERE `students`.`status` = 'Aktif'
GROUP BY `students`.`id`, `students`.`nisn`, `students`.`nis`, `students`.`total_violation_points`, `users`.`full_name`, `users`.`email`, `classes`.`class_name`
HAVING COUNT(DISTINCT counseling_sessions.id) > 0
ORDER BY `total_sessions` DESC
 LIMIT 10

    private function getRecentActivities($counselorId)
    {
        // Use query builder directly to avoid soft delete conflicts
        $recentSessions = $this->db->table('counseling_sessions')
            ->select('counseling_sessions.id, counseling_sessions.topic,
                      counseling_sessions.session_date, counseling_sessions.session_type,
                      counseling_sessions.updated_at,
                      students.nisn,
                      users.full_name as student_name')
            ->join('students', 'students.id = counseling_sessions.student_id', 'left')
            ->join('users', 'users.id = students.user_id', 'left')
            ->where('counseling_sessions.counselor_id', $counselorId)
            ->where('counseling_sessions.status', 'Selesai')
            ->where('counseling_sessions.deleted_at', null)
            ->orderBy('counseling_sessions.updated_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `counseling_sessions`.`id`, `counseling_sessions`.`topic`, `counseling_sessions`.`session_date`, `counseling_sessions`.`session_type`, `counseling_sessions`.`updated_at`, `students`.`nisn`, `users`.`full_name` as `student_name`
FROM `counseling_sessions`
LEFT JOIN `students` ON `students`.`id` = `counseling_sessions`.`student_id`
LEFT JOIN `users` ON `users`.`id` = `students`.`user_id`
WHERE `counseling_sessions`.`counselor_id` = 15
AND `counseling_sessions`.`status` = 'Selesai'
AND `counseling_sessions`.`deleted_at` IS NULL
ORDER BY `counseling_sessions`.`updated_at` DESC
 LIMIT 5

    private function getPendingSessions($counselorId)
    {
        // Use query builder directly to avoid soft delete conflicts
        return $this->db->table('counseling_sessions')
            ->select('counseling_sessions.*,
                      students.nisn,
                      users.full_name as student_name')
            ->join('students', 'students.id = counseling_sessions.student_id', 'left')
            ->join('users', 'users.id = students.user_id', 'left')
            ->where('counseling_sessions.counselor_id', $counselorId)
            ->where('counseling_sessions.status', 'Selesai')
            ->where('counseling_sessions.follow_up_plan IS NOT NULL', null, false)
            ->where('counseling_sessions.follow_up_plan !=', '')
            ->where('counseling_sessions.deleted_at', null)
            ->orderBy('counseling_sessions.session_date', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT `counseling_sessions`.*, `students`.`nisn`, `users`.`full_name` as `student_name`
FROM `counseling_sessions`
LEFT JOIN `students` ON `students`.`id` = `counseling_sessions`.`student_id`
LEFT JOIN `users` ON `users`.`id` = `students`.`user_id`
WHERE `counseling_sessions`.`counselor_id` = 15
AND `counseling_sessions`.`status` = 'Selesai'
AND counseling_sessions.follow_up_plan IS NOT NULL
AND `counseling_sessions`.`follow_up_plan` != ''
AND `counseling_sessions`.`deleted_at` IS NULL
ORDER BY `counseling_sessions`.`session_date` DESC
 LIMIT 5