app/Controllers/HomeroomTeacher/DashboardController.php

SELECT COUNT(DISTINCT violations.student_id) as count
FROM `violations`
INNER JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND `violations`.`deleted_at` IS NULL
---
            ->countAllResults();

        // Average violation points per student
        $totalPoints = $db->table('violations')
            ->selectSum('violation_categories.points', 'total_points')
            ->join('students', 'students.id = violations.student_id')
            ->join('violation_categories', 'violation_categories.id = violations.category_id')
            ->where('students.class_id', $classId)
            ->where('violations.deleted_at', null)
            ->get()
            ->getRowArray();