app/Controllers/HomeroomTeacher/DashboardController.php

SELECT `classes`.*, `academic_years`.`year_name`, `academic_years`.`semester`
FROM `classes`
JOIN `academic_years` ON `academic_years`.`id` = `classes`.`academic_year_id`
WHERE `classes`.`homeroom_teacher_id` = 5
AND `classes`.`deleted_at` IS NULL
AND `academic_years`.`is_active` = 1
ORDER BY `classes`.`created_at` DESC
---
    private function getHomeroomClass($userId)
    {
        try {
            $class = $this->db->table('classes')
                ->select('classes.*, academic_years.year_name, academic_years.semester')
                ->join('academic_years', 'academic_years.id = classes.academic_year_id')
                ->where('classes.homeroom_teacher_id', $userId)
                ->where('classes.deleted_at', null)
                ->where('academic_years.is_active', 1)
                ->orderBy('classes.created_at', 'DESC')
                ->get()
                ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `class_id` = '1'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND MONTH(violations.violation_date) = '10'
AND YEAR(violations.violation_date) = '2025'
AND `violations`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND `violations`.`violation_date` >= '2025-10-01'
AND `violations`.`deleted_at` IS NULL
SELECT COUNT(DISTINCT violations.student_id) as count
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND MONTH(violations.violation_date) = '10'
AND YEAR(violations.violation_date) = '2025'
AND `violations`.`deleted_at` IS NULL
SELECT COUNT(DISTINCT counseling_sessions.student_id) as count
FROM `counseling_sessions`
JOIN `students` ON `students`.`id` = `counseling_sessions`.`student_id`
WHERE `students`.`class_id` = '1'
AND MONTH(counseling_sessions.session_date) = '10'
AND YEAR(counseling_sessions.session_date) = '2025'
AND `counseling_sessions`.`deleted_at` IS NULL
SELECT AVG(violation_categories.point_deduction) as avg_points
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
JOIN `violation_categories` ON `violation_categories`.`id` = `violations`.`category_id`
WHERE `students`.`class_id` = '1'
AND `violations`.`deleted_at` IS NULL
---
    private function getClassStatistics($classId)
    {
        try {
            $stats = [];

            // Total students
            $stats['total_students'] = $this->db->table('students')
                ->where('class_id', $classId)
                ->where('deleted_at', null)
                ->countAllResults();

            // Total violations this month
            $stats['violations_this_month'] = $this->db->table('violations')
                ->join('students', 'students.id = violations.student_id')
                ->where('students.class_id', $classId)
                ->where('MONTH(violations.violation_date)', date('m'))
                ->where('YEAR(violations.violation_date)', date('Y'))
                ->where('violations.deleted_at', null)
                ->countAllResults();

            // Total violations this week
            $stats['violations_this_week'] = $this->db->table('violations')
                ->join('students', 'students.id = violations.student_id')
                ->where('students.class_id', $classId)
                ->where('violations.violation_date >=', date('Y-m-d', strtotime('-7 days')))
                ->where('violations.deleted_at', null)
                ->countAllResults();

            // Students with violations this month
            $stats['students_with_violations'] = $this->db->table('violations')
                ->select('COUNT(DISTINCT violations.student_id) as count')
                ->join('students', 'students.id = violations.student_id')
                ->where('students.class_id', $classId)
                ->where('MONTH(violations.violation_date)', date('m'))
                ->where('YEAR(violations.violation_date)', date('Y'))
                ->where('violations.deleted_at', null)
                ->get()
                ->getRow()
                ->count ?? 0;

            // Students in counseling this month
            $stats['students_in_counseling'] = $this->db->table('counseling_sessions')
                ->select('COUNT(DISTINCT counseling_sessions.student_id) as count')
                ->join('students', 'students.id = counseling_sessions.student_id')
                ->where('students.class_id', $classId)
                ->where('MONTH(counseling_sessions.session_date)', date('m'))
                ->where('YEAR(counseling_sessions.session_date)', date('Y'))
                ->where('counseling_sessions.deleted_at', null)
                ->get()
                ->getRow()
                ->count ?? 0;

            // Average violation points
            $avgPoints = $this->db->table('violations')
                ->select('AVG(violation_categories.point_deduction) as avg_points')
                ->join('students', 'students.id = violations.student_id')
                ->join('violation_categories', 'violation_categories.id = violations.category_id')
                ->where('students.class_id', $classId)
                ->where('violations.deleted_at', null)
                ->get()
                ->getRow();

SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `class_id` = '1'
AND `gender` = 'Laki-laki'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `class_id` = '1'
AND `gender` = 'Perempuan'
AND `deleted_at` IS NULL
---
            $stats['avg_violation_points'] = $avgPoints ? round($avgPoints->avg_points, 1) : 0;

            // Gender distribution
            $maleCount = $this->db->table('students')
                ->where('class_id', $classId)
                ->where('gender', 'Laki-laki')
                ->where('deleted_at', null)
                ->countAllResults();

            $femaleCount = $this->db->table('students')
                ->where('class_id', $classId)
                ->where('gender', 'Perempuan')
                ->where('deleted_at', null)
                ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND MONTH(violations.violation_date) = '09'
AND YEAR(violations.violation_date) = '2025'
AND `violations`.`deleted_at` IS NULL
---
            ];

            // Percentage changes (compare with last month)
            $lastMonthViolations = $this->db->table('violations')
                ->join('students', 'students.id = violations.student_id')
                ->where('students.class_id', $classId)
                ->where('MONTH(violations.violation_date)', date('m', strtotime('-1 month')))
                ->where('YEAR(violations.violation_date)', date('Y', strtotime('-1 month')))
                ->where('violations.deleted_at', null)
                ->countAllResults();

SELECT `violations`.*, `students`.`full_name` as `student_name`, `students`.`nisn`, `violation_categories`.`category_name`, `violation_categories`.`severity_level`, `violation_categories`.`point_deduction`, `users`.`full_name` as `reported_by_name`
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
JOIN `violation_categories` ON `violation_categories`.`id` = `violations`.`category_id`
JOIN `users` ON `users`.`id` = `violations`.`reported_by`
WHERE `students`.`class_id` = '1'
AND `violations`.`violation_date` >= '2025-10-01'
AND `violations`.`deleted_at` IS NULL
ORDER BY `violations`.`violation_date` DESC, `violations`.`created_at` DESC
 LIMIT 10
---
    private function getRecentViolations($classId, $days = 7)
    {
        try {
            return $this->db->table('violations')
                ->select('violations.*, students.full_name as student_name, students.nisn,
                         violation_categories.category_name, violation_categories.severity_level,
                         violation_categories.point_deduction,
                         users.full_name as reported_by_name')
                ->join('students', 'students.id = violations.student_id')
                ->join('violation_categories', 'violation_categories.id = violations.category_id')
                ->join('users', 'users.id = violations.reported_by')
                ->where('students.class_id', $classId)
                ->where('violations.violation_date >=', date('Y-m-d', strtotime("-{$days} days")))
                ->where('violations.deleted_at', null)
                ->orderBy('violations.violation_date', 'DESC')
                ->orderBy('violations.created_at', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `violations`
JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND DATE_FORMAT(violations.violation_date, '%Y-%m') = '2025-05'
AND `violations`.`deleted_at` IS NULL
---
    private function getViolationTrends($classId, $months = 6)
    {
        try {
            $trends = [];

            for ($i = $months - 1; $i >= 0; $i--) {
                $month = date('Y-m', strtotime("-{$i} months"));
                $monthName = date('M Y', strtotime("-{$i} months"));

                $count = $this->db->table('violations')
                    ->join('students', 'students.id = violations.student_id')
                    ->where('students.class_id', $classId)
                    ->where("DATE_FORMAT(violations.violation_date, '%Y-%m')", $month)
                    ->where('violations.deleted_at', null)
                    ->countAllResults();

SELECT `students`.`id`, `students`.`full_name`, `students`.`nisn`, COUNT(violations.id) as violation_count, SUM(violation_categories.point_deduction) as total_points
FROM `students`
LEFT JOIN `violations` ON `violations`.`student_id` = `students`.`id` AND `violations`.`deleted_at` IS NULL
LEFT JOIN `violation_categories` ON `violation_categories`.`id` = `violations`.`category_id`
WHERE `students`.`class_id` = '1'
AND `students`.`deleted_at` IS NULL
GROUP BY `students`.`id`
HAVING `violation_count` > 0
ORDER BY `total_points` DESC, `violation_count` DESC
 LIMIT 5
---
    private function getTopViolators($classId, $limit = 5)
    {
        try {
            return $this->db->table('students')
                ->select('students.id, students.full_name, students.nisn,
                         COUNT(violations.id) as violation_count,
                        SUM(violation_categories.point_deduction) as total_points')
                ->join('violations', 'violations.student_id = students.id AND violations.deleted_at IS NULL', 'left')
                ->join('violation_categories', 'violation_categories.id = violations.category_id', 'left')
                ->where('students.class_id', $classId)
                ->where('students.deleted_at', null)
                ->groupBy('students.id')
                ->having('violation_count >', 0)
                ->orderBy('total_points', 'DESC')
                ->orderBy('violation_count', 'DESC')
                ->limit($limit)
                ->get()
                ->getResultArray();

SELECT `counseling_sessions`.*, `students`.`full_name` as `student_name`, `students`.`nisn`, `users`.`full_name` as `counselor_name`
FROM `counseling_sessions`
JOIN `students` ON `students`.`id` = `counseling_sessions`.`student_id`
JOIN `users` ON `users`.`id` = `counseling_sessions`.`counselor_id`
WHERE `students`.`class_id` = '1'
AND `counseling_sessions`.`deleted_at` IS NULL
ORDER BY `counseling_sessions`.`session_date` DESC, `counseling_sessions`.`created_at` DESC
 LIMIT 5
---
    private function getRecentSessions($classId, $limit = 5)
    {
        try {
            return $this->db->table('counseling_sessions')
                ->select('counseling_sessions.*, students.full_name as student_name, students.nisn,
                         users.full_name as counselor_name')
                ->join('students', 'students.id = counseling_sessions.student_id')
                ->join('users', 'users.id = counseling_sessions.counselor_id')
                ->where('students.class_id', $classId)
                ->where('counseling_sessions.deleted_at', null)
                ->orderBy('counseling_sessions.session_date', 'DESC')
                ->orderBy('counseling_sessions.created_at', 'DESC')
                ->limit($limit)
                ->get()
                ->getResultArray();

SELECT `violation_categories`.`category_name`, COUNT(violations.id) as count, `violation_categories`.`severity_level`
FROM `violation_categories`
LEFT JOIN `violations` ON `violations`.`category_id` = `violation_categories`.`id` AND `violations`.`deleted_at` IS NULL
LEFT JOIN `students` ON `students`.`id` = `violations`.`student_id`
WHERE `students`.`class_id` = '1'
AND `violation_categories`.`deleted_at` IS NULL
GROUP BY `violation_categories`.`id`
ORDER BY `count` DESC
 LIMIT 5
---
    private function getViolationByCategory($classId)
    {
        try {
            return $this->db->table('violation_categories')
                ->select('violation_categories.category_name,
                         COUNT(violations.id) as count,
                         violation_categories.severity_level')
                ->join('violations', 'violations.category_id = violation_categories.id AND violations.deleted_at IS NULL', 'left')
                ->join('students', 'students.id = violations.student_id', 'left')
                ->where('students.class_id', $classId)
                ->where('violation_categories.deleted_at', null)
                ->groupBy('violation_categories.id')
                ->orderBy('count', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();