app/Controllers/HomeroomTeacher/ViolationController.php

    private function getHomeroomClass($userId)
    {
        try {
            return $this->db->table('classes')
                ->select('classes.*, academic_years.year_name, academic_years.semester')
                ->join('academic_years', 'academic_years.id = classes.academic_year_id')
                ->where('classes.homeroom_teacher_id', $userId)
                ->where('classes.deleted_at', null)
                ->where('academic_years.is_active', 1)
                ->orderBy('classes.created_at', 'DESC')
                ->get()
                ->getRowArray();
---
SELECT `classes`.*, `academic_years`.`year_name`, `academic_years`.`semester`
FROM `classes`
JOIN `academic_years` ON `academic_years`.`id` = `classes`.`academic_year_id`
WHERE `classes`.`homeroom_teacher_id` = 5
AND `classes`.`deleted_at` IS NULL
AND `academic_years`.`is_active` = 1
ORDER BY `classes`.`created_at` DESC

    private function getClassStudents($classId)
    {
        try {
            return $this->db->table('students')
                ->select([
                    'students.id',
                    'students.nisn',
                    "COALESCE(NULLIF(students.full_name, ''), users.full_name) AS full_name",
                ])
                ->join('users', 'users.id = students.user_id', 'left')
                ->where('students.class_id', $classId)
                ->where('students.deleted_at', null)
                ->orderBy('full_name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `students`.`id`, `students`.`nisn`, COALESCE(NULLIF(students.full_name, ''), users.full_name) AS full_name
FROM `students`
LEFT JOIN `users` ON `users`.`id` = `students`.`user_id`
WHERE `students`.`class_id` = '1'
AND `students`.`deleted_at` IS NULL
ORDER BY `full_name` ASC